{
  "intents": [
    {
      "parent_tag": "greeting",
      "tag": "hii",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day",
        "Knock ,Knock",
        "Hii",
        "Good Morning",
        "Good Afternoon"
      ],
      "responses": [

        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "parent_tag": "greeting",
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "See you later",
        "Goodbye"
      ],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "parent_tag": "file",
      "tag": "open file",
      "patterns": [
        "How to open file?",
        "Can you open teamcenter guide?",
        "Can you open user guide?",
        "Do you have user guide?",
        "Do you have any user guide",
        "Do you have manual",
        "Can you show me any user guide"
      ],
      "responses": [
        "D:/PLM Nordic/my_teamcenter.pdf"
      ]
    },
    {
      "parent_tag": "file",
      "tag": "delete file",
      "patterns": [
        "How to delete file?",
        "Can you delete teamcenter file?",
        "Can you delete user guide?"
      ],
      "responses": [
        "D:/PLM Nordic/my_teamcenter.pdf"
      ]
    },
    {
      "parent_tag": "None of the above",
      "tag": "none of the above",
      "patterns": [
        ""
      ],
      "responses": [
        "I will transfer your question to support team"
      ]
    },

    {
      "parent_tag": "rich client",
      "tag": "about rich client",
      "patterns": [
        "What is rich client?",
        "Tell me about rich client",
        "Can you tell me about rich client",
        "tell me something about rich client",
        "Help me with rich client",
        "Define rich client"
      ],
      "responses": [
        "It is a client to work in tc"
      ]
    },
    {
      "parent_tag": "rich client",
      "tag": "install rich client",
      "patterns": [
        "how to install rich client?",
        "how do I get rich client ",
        "Whom to contact for rich client",
        "How do I get Teamcenter?"
      ],
      "responses": [
        "Please send mail to servicedesk@plmnordic.com or contact your admin"
      ]
    },
    {
      "parent_tag": "rich client",
      "tag": "get rich client",
      "patterns": [
        "who can get rich clients?",
        "Can I get teamcenter?",
        "Get me a rich client"
      ],
      "responses": [
        "only designers can get rich client"
      ]
    },
    {
      "parent_tag": "Unit of Measure",
      "tag": "what which UOM",
      "patterns": [
        "What UoM can i use for steel pipe?",
        "what uom shall i use for steel pipe",
        "Which unit of measure should I use?",
        "What is UOM?",
        "Define UOM",
        "can i use CM as UOM?",
        "How many unit of measures available in TC",
        "Tell me about UOM in TC?",
        "what unit of measure"
      ],
      "responses": [
        "Below is the  unit of measure allowed for different item : 1.Normal items (piece parts) = Pieces Raw materials like pipe, plates, etc = mm, m, kg, gm, 2.tonn packaged/bulk items = set. You can only use one of the above values from dropdown."
      ]
    },
    {
      "parent_tag": "Unit of Measure",
      "tag": "add new  Unit of Measure",
      "patterns": [
        "how can i get new UOM added to list?",
        "I need new UOM",
        "I cannot find cm in UOM",
        "Who can add new UMO?",
        "can i get new uom"
      ],
      "responses": [
        "Teamcenter manager/administrator can decide to add new UOM in list. Pl fill this form and send in mail to helpdesk@plmnordic.com"
      ]
    },
    {
            "parent_tag": "folder",
            "tag": "about folder",
            "patterns": [
                "What is the use of folder in Teamcenter?",
                "What is Teamcenter folder?",
                "Tell me about folder",
                "What is Folder in Teamcenter?"
            ],
            "responses": [
                "Folder in Teamcenter can be used to organize data and collect objects like items and documents at one place. You can create your own folders or multiple users or a group can work on same folder."
            ]
        },
        {
            "parent_tag": "folder",
            "tag": "copy folder",
            "patterns": [
                "Do I duplicate data when I copy paste folders?",
                "Does copy folder duplicate data?",
                "what does copy paste folder do",
                "duplicate copy paste folder?",
                "duplicate copy folder?",
                "How copy paste folder works?",
                "Tell me information about copy paste folder",
                "copy folder"
            ],
            "responses": [
                "When Folders are copy pasted it just creates a reference meaning it does not create copy of data but points to same data. You can search a folder created by your teammate and copy it to your home folder. This way both can see and work on same folder. Be aware that folder names are not unique meaning you can create folder with same name."
            ]
        },
        {
            "parent_tag": "folder",
            "tag": "delete folder",
            "patterns": [
                "Tell me about deleting folder in Teamcenter?",
                "can i delete folder in teamcenter?",
                "tell me how to delete folder in teamcenter?",
                "how can i delete folder ?",
                "tell me how to delete folder ?",
                "information of how to delete folder ?",
              "can i delete folder",
              "how to delete folder"
            ],
            "responses": [
                "Folder can be deleted if you own it. Select the folder and use delete button."
            ]
        },
    {
      "parent_tag": "1",
      "tag": "1",
      "patterns": [
        "What is Teamcenter PLM?"
      ],
      "responses": [
        "Teamcenter is a comprehensive PLM software from Siemens that helps in all stages of product life from Concept to Retirement.\nIt provides a modern and adaptable platform to capture and execute the product development processes like requirements, design, validation. It can be extended to include downstream processes like planning, production, procurement, service, etc.\nTeamcenter along with ERP system can be the two most essential executive systems within your company."
      ]
    },
    {
      "parent_tag": "2",
      "tag": "2",
      "patterns": [
        "What is the use of Teamcenter?"
      ],
      "responses": [
        "Teamcenter has many benefits or usages. Some of them are mentioned below.\nIncrease efficiency in product development by reducing the time taken for data retrieval, search, storage.\nReduce costs by increasing part usage, reducing rework by giving accurate single source of up to date information.\nProviding a system to manage complex processes and ensure compliance to it by providing tools like notifications, worklist, workflows, etc.\nIncrease sales by making it possible to provide product configuration capabilities and reducing lead times and reducing the cost of development.\nReducing costs through effective change management. Make it possible to manage complex products and processes."
      ]
    },
    {
      "parent_tag": "3",
      "tag": "3",
      "patterns": [
        "Who uses Teamcenter?"
      ],
      "responses": [
        "Teamcenter is used by almost all departments in business for various purposes. Engineering or R&D use it to create, change, release product design definitions like 2D, 3D, BOM, how-to instructions. etc.\nThe planning department can use it to plan production or procurement based on parts and assemblies released by R&D.\nSales can use it to create customer-specific orders (Sales order or BOM), also integrate with their sales tool to get automatic drawings, technical specs for quotations or bids.\nProduction can use it to create M-BOM (Manufacturing BOM) from E-BOM (Engineering BOM) and also access the latest drawings, instructions, and changes.\nProcurement can use it to access the latest drawings and changes and interact with suppliers directly using the supplier collaboration module.\nService can use it to get As-Built to see what product is delivered. They can maintain an AS-MAINTAINED BOM in Teamcenter to know what exact configuration exists at customer place and help them to serve better and sell spare parts. They can create CUSTOMER-BOM to match service manuals, instructions, and update digitally. All these have huge benefits of doing in one single system rather than doing in different non-connected systems.\nAll the world-leading companies use PLM software to optimize their costs and increase revenues."
      ]
    },
    {
      "parent_tag": "4",
      "tag": "4",
      "patterns": [
        "What is Teamcenter rapid start?"
      ],
      "responses": [
        "Teamcenter Rapid Start is a lighter version of Teamcenter for organizations that need to quickly enable PDM benefits.\nTypically it has good CAD integration with leading CAD software and helps with design data management.\n"
      ]
    },
    {
      "parent_tag": "5",
      "tag": "5",
      "patterns": [
        "What is structure manager in Teamcenter?"
      ],
      "responses": [
        "Structure Manager is a module to create and manage Bill of Materials in Teamcenter.\nIt also provides a lot of functionalities apart from BOM management like 3D visualization, variants and options, view related files, BOM compares, Redlining, BOM reports, and many more."
      ]
    },
    {
      "parent_tag": "6",
      "tag": "6",
      "patterns": [
        "What is teamcenter preference?"
      ],
      "responses": [
        "Preferences are like settings in Teamcenter. You can turn ON or OFF certain functionalities like advanced logs or you can choose between options like the location of logs etc.\nThis makes Teamcenter much more flexible to use. Preferences can be set for user, group, or site level."
      ]
    },
    {
      "parent_tag": "7",
      "tag": "7",
      "patterns": [
        "How much does Teamcenter cost?"
      ],
      "responses": [
        "Unfortunately, Teamcenterï¿½s price is quote-based and varies depending on which product modules you choose.\nVendors have made it non-transparent and complicated, sorry to say. Cost depends on the modules and packages you choose.\nThe license could be perpetual, meaning you own it forever or subscription-based (pay per year).\nIn a perpetual license, you pay a fixed cost per number of licenses and you pay an annual maintenance cost for getting new product updates and features.\nConsidering everything, for just guidance, we can assume that the typical perpetual license cost could be over 400 USD per user per year for basic PLM modules.\nPLM Software is costly, and many companies are spending millions per year on annual maintenance making it even more important to implement properly and make full use of it."
      ]
    },
    {
      "parent_tag": "8",
      "tag": "8",
      "patterns": [
        "What is Teamcenter Enterprise?"
      ],
      "responses": [
        "It is an old platform for Teamcenter. Siemens moved to the Unified platform around 2007.\nBefore that, it had Teamcenter Enterprise and Teamcenter Engineering as two platforms."
      ]
    },
    {
      "parent_tag": "9",
      "tag": "9",
      "patterns": [
        "What is difference between item & item revision in Teamcenter?"
      ],
      "responses": [
        "Item is like a container for a particular part that defines properties that do not change from revision to revision such as part number, part name, etc.\nThe item itself does not participate in the process and itï¿½s always the Item revision which we work with and associate files to it.\nTeamcenter by default creates one Item revision when we create an Item."
      ]
    },
    {
      "parent_tag": "10",
      "tag": "10",
      "patterns": [
        "What is Teamcenter data model?"
      ],
      "responses": [
        "The data model is a term used to describe the basic framework of Teamcenter. Teamcenter is flexible and can be changed/configured according to customer requirements.\nFor example, a customer might need the first revision to start with 1 instead of A or numbering to start with B001, etc.\nThe data model takes care of this basic architecture. BMIDE is used to configure most of the data model along with preferences.\nThe data model is very important as it is difficult to change it once data is populated. Example Teamcenter does not allow to delete attributes if there are items using it. There could be a lot of internal references created in the database for different objects. Hence defining a good data model is crucial.\nThe data model also plays important role in performance. Not using forms and using attributes on Item revision can help in performance. It also affects usability and nearly all aspects of Teamcenter."
      ]
    },
    {
      "parent_tag": "11",
      "tag": "11",
      "patterns": [
        "What is Teamcenter change management?"
      ],
      "responses": [
        "Teamcenter change management provides a comprehensive set of tools to create and manage change in Teamcenter. It is a flexible solution that can be tuned to any process.\nTeamcenter uses objects called PR(problem report), CR (Change Request), and CN (Change notice) and Workflows to capture business processes. It provides functionalities like auto-checking, notifications, rules, etc in workflows to make the process effective.\nThe biggest advantage of change management is traceability. Anyone in the company having access can see what is changed for what, by whom, when, and what is impacted, etc. It saves time in rework and better control over complexity."
      ]
    },
    {
      "parent_tag": "12",
      "tag": "12",
      "patterns": [
        "What is dataset in Teamcenter?"
      ],
      "responses": [
        "A dataset in Teamcenter is nothing but anything which has a file associated with it. It can be a CAD dataset having a 2D drawing or 3D model. It can be an instruction having a word or PDF file.\nIt can be a ppt, Xls, text, or any other format. Dataset can also be empty with no file for placeholder or other purposes. One or more datasets describe or specify the item revision.\nThese datasets are checked during release and froze after release."
      ]
    },
    {
      "parent_tag": "13",
      "tag": "13",
      "patterns": [
        "What is Access manager in Teamcenter?"
      ],
      "responses": [
        "Access Manager is a dedicated module in Teamcenter to define and manage accesses based on users, roles, groups, locations, and Projects.\nIt is highly flexible and provides the opportunity to configure according to business needs. It can evolve over time as the need arises from simple to complex rules.\nA simple Example is the Designer or Author role can have access to all data while the Basic user can only view data."
      ]
    },
    {
      "parent_tag": "14",
      "tag": "14",
      "patterns": [
        "What is revision rule in Teamcenter?"
      ],
      "responses": [
        "Teamcenter can have multiple revisions of an item and there can be different status on revision like working, released, preliminary, expired, etc.\nThe revision rule helps to view a bill of material from a different perspective. For example, a working revision rule shows all the latest working revisions in a bill of material,- Revision rules can be custom made like showing the latest released revisions first, and if not exists then show working or by date or by other rules.\nGenerally, the design department uses the latest working view while manufacturing might want to see the latest released only."
      ]
    },
    {
      "parent_tag": "15",
      "tag": "15",
      "patterns": [
        "What is Teamcenter X?"
      ],
      "responses": [
        "Teamcenter X is a modern cloud-based SaaS PLM platform from Siemens. Teamcenter X has all the functionalities which the traditional Teamcenter Unified has but it also has cloud benefits.\nIt is managed by Siemens and instant up. There is no need to upgrade separately.\n"
      ]
    },
    {
      "parent_tag": "16",
      "tag": "16",
      "patterns": [
        "What CAD softwares Teamcenter supports?"
      ],
      "responses": [
        "Teamcenter provides integration with and supports a lot of CAD software like NX, CATIA, CREO, Solidege, Solidworks, AutoCAD, Inventor, and many more.\nTeamcenter is very strong on CAD integrations and has 3D visualization at the core of its solution."
      ]
    },
    {
      "parent_tag": "17",
      "tag": "17",
      "patterns": [
        "How is Teamcenter ERP interface?"
      ],
      "responses": [
        "Teamcenter provides an interface framework for connecting to any ERP system caller T4Ea or T4E.\nTeamcenter also provides one of the best PLM-ERP interface available for any business called Teamcenter for SAP (T4S) integration.\nIt provides functionality to transfer data bi-directionally as well as view data in each otherï¿½ system. Teamcenter and SAP together can provide all the data and process background for any company.\n"
      ]
    },
    {
      "parent_tag": "18",
      "tag": "18",
      "patterns": [
        "What is FMS FCC & FSC in Teamcenter?"
      ],
      "responses": [
        "The file management System in Teamcenter is a comprehensive mechanism to create, retrieve, and store files in a secured and fast way in Teamcenter.\nIt has two major components Server-side and Client-Side. On the server-side, there exist one or more services that manage one or more volumes (vault or folders). There is also a cache on the server-side.\nClient-side there is a local client cache and process which helps check the latest version of the file and make it available to the client.\nThere could be various ways the FMS can be set up depending on locations, number of users, environment, etc."
      ]
    },
    {
      "parent_tag": "19",
      "tag": "19",
      "patterns": [
        "What are the different client types in Teamcenter?"
      ],
      "responses": [
        "Teamcenter can be accessed using the number of different clients. Most common is the rich client which gives all the functionalities. Depending on your setup it can be 4 tier client or 2 tier client.\nTC also provides a web client called Active workspace which works on any browser and can be used for many functionalities including accessing CAD data.\nThere are also web clients, thin clients available with some versions of Teamcenter."
      ]
    },
    {
      "parent_tag": "20",
      "tag": "20",
      "patterns": [
        "How is document management in Teamcenter?"
      ],
      "responses": [
        "You can by default manage documents in Teamcenter using OOTB item types and functionalities like version control, check-in, check-out, access control, etc.\nTeamcenter supports integration with Microsoft office and can work and save documents from MS office directly in TC. You can modify and save BOMs from Excel.\nIt also has dedicated modules for advanced document management functionalities and also supports third-party tools like Cortona 3D for more advanced authoring for instruction manuals etc."
      ]
    },
    {
      "parent_tag": "21",
      "tag": "21",
      "patterns": [
        "Where do you get help with Teamcenter?"
      ],
      "responses": [
        "Teamcenter is one of the worldï¿½s most widely used PLM software. There are many channels for help. The official site for Teamcenter is the Siemens GTAC site.\nThere are a number of other forums, LinkedIn and Facebook groups, Blogs, etc available for help. You can always write to us or book a consultation call with us to get free help on any issues you are facing."
      ]
    },
    {
      "parent_tag": "22",
      "tag": "22",
      "patterns": [
        "What is Mendix in relation to Teamcenter?"
      ],
      "responses": [
        "Mendix is an Application and extending the domain model we can create an app, build, deploy, and using the app to create, modified to the domain model.\nIn relation, Teamcenter is a virtual gateway to your companyï¿½s product information, connecting all who need to collaborate with product and process knowledge.\nTeamcenter Connector for Mendix enables Mendix developers to access product data from Teamcenter or create and modify the product data in Teamcenter.\nThe Teamcenter Connector built for Mendix creates a wrapper around these SOA\nThe example includes building a simple Issue / Change Management Tracker for modules in Teamcenter have different entities and their relationship hierarchy"
      ]
    },
    {
      "parent_tag": "change password",
      "tag": "change password",
      "patterns": [
        "how to change password in Teamcenter?"
      ],
      "responses": [
        "First edit user settings then click on the login tab appeared, click on the Change Password button. Last step is to type the old password, the new password and confirm the new password, then save the same."
      ]
    },
    {
      "parent_tag": "SLU",
      "tag": "SLU",
      "patterns": [
        "What is meant by SLU?"
      ],
      "responses": [
        "SLU is a 120% BOM for a particular engine type for example D3645L6 is an SLU for D type engine with 6 cylinders. Similarly there are other SLUs like D3645L9, D3645L12 etc. "
      ]
    }
  ]
}


